In [1]:
from __future__ import print_function, division
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
from IPython.display import display, HTML, Math, Latex

In [2]:
import datetime
import mysql.connector 
from sqlalchemy import create_engine

In [3]:
database = 'Northwind'

In [4]:
%run auth.py
%load_ext sql
%sql $uri$database

'Connected: root@Northwind'

## MySQL queries

In [5]:
%%sql 
SELECT o.OrderID, o.CustomerID, o.EmployeeID, o.OrderDate, p.amount 
FROM Orders o 
JOIN (
    SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount 
    FROM Order_Details 
    GROUP BY OrderID
) p 
USING(OrderID) 
ORDER BY OrderID
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(10248, 'VINET', 5, datetime.datetime(1996, 7, 4, 0, 0), Decimal('440.0000')),
 (10249, 'TOMSP', 6, datetime.datetime(1996, 7, 5, 0, 0), Decimal('1863.4000')),
 (10250, 'HANAR', 4, datetime.datetime(1996, 7, 8, 0, 0), Decimal('1813.0000')),
 (10251, 'VICTE', 3, datetime.datetime(1996, 7, 8, 0, 0), Decimal('670.8000')),
 (10252, 'SUPRD', 4, datetime.datetime(1996, 7, 9, 0, 0), Decimal('3730.0000')),
 (10253, 'HANAR', 3, datetime.datetime(1996, 7, 10, 0, 0), Decimal('1444.8000')),
 (10254, 'CHOPS', 5, datetime.datetime(1996, 7, 11, 0, 0), Decimal('625.2000')),
 (10255, 'RICSU', 9, datetime.datetime(1996, 7, 12, 0, 0), Decimal('2490.5000')),
 (10256, 'WELLI', 3, datetime.datetime(1996, 7, 15, 0, 0), Decimal('517.8000')),
 (10257, 'HILAA', 4, datetime.datetime(1996, 7, 16, 0, 0), Decimal('1119.9000'))]

In [6]:
%%sql 
WITH ods AS (
    SELECT o.OrderID, o.CustomerID, o.EmployeeID, o.OrderDate, p.amount 
    FROM Orders o 
    JOIN (
        SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount 
        FROM Order_Details 
        GROUP BY OrderID
    ) p 
    USING(OrderID) 
    ORDER BY OrderID
),
cus_ods AS (
    SELECT CustomerID, DATE(OrderDate) AS OrderDate, SUM(amount) AS amounts FROM ods GROUP BY 1,2 
)
SELECT *, 
    ROW_NUMBER() OVER (PARTITION BY CustomerID ORDER BY OrderDate) AS num_order,
    LAG(OrderDate) OVER (PARTITION BY CustomerID ORDER BY OrderDate) AS last_order, 
    LEAD(OrderDate) OVER (PARTITION BY CustomerID ORDER BY OrderDate) AS next_order,
    DATEDIFF(OrderDate, (LAG(OrderDate) OVER (PARTITION BY CustomerID ORDER BY OrderDate))) AS days_from_previous,
    DATEDIFF((LEAD(OrderDate) OVER (PARTITION BY CustomerID ORDER BY OrderDate)), OrderDate) AS days_for_next
FROM cus_ods 
ORDER BY CustomerID
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[('ALFKI', datetime.date(1997, 8, 25), Decimal('1086.0000'), 1, None, datetime.date(1997, 10, 3), None, 39),
 ('ALFKI', datetime.date(1997, 10, 3), Decimal('878.0000'), 2, datetime.date(1997, 8, 25), datetime.date(1997, 10, 13), 39, 10),
 ('ALFKI', datetime.date(1997, 10, 13), Decimal('330.0000'), 3, datetime.date(1997, 10, 3), datetime.date(1998, 1, 15), 10, 94),
 ('ALFKI', datetime.date(1998, 1, 15), Decimal('851.0000'), 4, datetime.date(1997, 10, 13), datetime.date(1998, 3, 16), 94, 60),
 ('ALFKI', datetime.date(1998, 3, 16), Decimal('491.2000'), 5, datetime.date(1998, 1, 15), datetime.date(1998, 4, 9), 60, 24),
 ('ALFKI', datetime.date(1998, 4, 9), Decimal('960.0000'), 6, datetime.date(1998, 3, 16), None, 24, None),
 ('ANATR', datetime.date(1996, 9, 18), Decimal('88.8000'), 1, None, datetime.date(1997, 8, 8), None, 324),
 ('ANATR', datetime.date(1997, 8, 8), Decimal('479.7500'), 2, datetime.date(1996, 9, 18), datetime.date(1997, 11, 28), 324, 112),
 ('ANATR', datetime.date(1997, 11, 28), Decimal('320.0000'), 3, datetime.date(1997, 8, 8), datetime.date(1998, 3, 4), 112, 96),
 ('ANATR', datetime.date(1998, 3, 4), Decimal('514.4000'), 4, datetime.date(1997, 11, 28), None, 96, None)]

In [7]:
%%sql
SELECT o.OrderDate, SUM(p.amount) AS amount
FROM Orders o 
JOIN (SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount FROM Order_Details GROUP BY OrderID) p 
USING(OrderID) 
GROUP BY o.OrderDate
ORDER BY o.OrderDate
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(datetime.datetime(1996, 7, 4, 0, 0), Decimal('440.0000')),
 (datetime.datetime(1996, 7, 5, 0, 0), Decimal('1863.4000')),
 (datetime.datetime(1996, 7, 8, 0, 0), Decimal('2483.8000')),
 (datetime.datetime(1996, 7, 9, 0, 0), Decimal('3730.0000')),
 (datetime.datetime(1996, 7, 10, 0, 0), Decimal('1444.8000')),
 (datetime.datetime(1996, 7, 11, 0, 0), Decimal('625.2000')),
 (datetime.datetime(1996, 7, 12, 0, 0), Decimal('2490.5000')),
 (datetime.datetime(1996, 7, 15, 0, 0), Decimal('517.8000')),
 (datetime.datetime(1996, 7, 16, 0, 0), Decimal('1119.9000')),
 (datetime.datetime(1996, 7, 17, 0, 0), Decimal('2018.6000'))]

In [8]:
%%sql
WITH ods AS (
    SELECT DATE(o.OrderDate) AS OrderDate, SUM(p.amount) AS amount
    FROM Orders o 
    JOIN (SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount FROM Order_Details GROUP BY OrderID) p 
    USING(OrderID) 
    GROUP BY o.OrderDate
    ORDER BY o.OrderDate
)
SELECT *, 
    LAG(amount,1) OVER (ORDER BY OrderDate) AS ld_amount,
    LAG(amount,7) OVER (ORDER BY OrderDate) AS lw_amount, 
    CONCAT(ROUND((amount - (LAG(amount,1) OVER (ORDER BY OrderDate)))/(LAG(amount,1) OVER (ORDER BY OrderDate))*100,2),'%') AS ld_pct,
    CONCAT(ROUND((amount - (LAG(amount,7) OVER (ORDER BY OrderDate)))/(LAG(amount,7) OVER (ORDER BY OrderDate))*100,2),'%') AS lw_pct
FROM ods
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(datetime.date(1996, 7, 4), Decimal('440.0000'), None, None, None, None),
 (datetime.date(1996, 7, 5), Decimal('1863.4000'), Decimal('440.0000'), None, '323.50%', None),
 (datetime.date(1996, 7, 8), Decimal('2483.8000'), Decimal('1863.4000'), None, '33.29%', None),
 (datetime.date(1996, 7, 9), Decimal('3730.0000'), Decimal('2483.8000'), None, '50.17%', None),
 (datetime.date(1996, 7, 10), Decimal('1444.8000'), Decimal('3730.0000'), None, '-61.27%', None),
 (datetime.date(1996, 7, 11), Decimal('625.2000'), Decimal('1444.8000'), None, '-56.73%', None),
 (datetime.date(1996, 7, 12), Decimal('2490.5000'), Decimal('625.2000'), None, '298.35%', None),
 (datetime.date(1996, 7, 15), Decimal('517.8000'), Decimal('2490.5000'), Decimal('440.0000'), '-79.21%', '17.68%'),
 (datetime.date(1996, 7, 16), Decimal('1119.9000'), Decimal('517.8000'), Decimal('1863.4000'), '116.28%', '-39.90%'),
 (datetime.date(1996, 7, 17), Decimal('2018.6000'), Decimal('1119.9000'), Decimal('2483.8000'), '80.25%', '-18.73%')]

In [9]:
%%sql
WITH ods AS (
    SELECT DATE(o.OrderDate) AS OrderDate, 
        DATE_FORMAT(OrderDate,'%Y-%m') AS month,
        DATE_FORMAT(OrderDate,'%Y') AS year, 
        SUM(p.amount) AS amount
    FROM Orders o 
    JOIN (SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount FROM Order_Details GROUP BY OrderID) p 
    USING(OrderID) 
    GROUP BY o.OrderDate
    ORDER BY o.OrderDate
),
cum_amounts AS (
    SELECT *, 
        SUM(amount) OVER (PARTITION BY month ORDER BY OrderDate) AS mth_cum_amount, 
        SUM(amount) OVER (PARTITION BY year ORDER BY OrderDate) AS yr_cum_amount,
        SUM(amount) OVER (PARTITION BY month ORDER BY (SELECT 1)) AS mth_total_amount,
        SUM(amount) OVER (PARTITION BY year ORDER BY (SELECT 1)) AS yr_total_amount 
    FROM ods
)
SELECT 
    OrderDate, amount, 
    CONCAT(ROUND((mth_cum_amount/mth_total_amount)*100,2),'%') AS mth_cum_pct,
    CONCAT(ROUND((yr_cum_amount/yr_total_amount)*100,2),'%') AS yr_cum_pct
FROM cum_amounts
ORDER BY OrderDate 
LIMIT 20;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
20 rows affected.

[(datetime.date(1996, 7, 4), Decimal('440.0000'), '1.46%', '0.19%'),
 (datetime.date(1996, 7, 5), Decimal('1863.4000'), '7.63%', '1.02%'),
 (datetime.date(1996, 7, 8), Decimal('2483.8000'), '15.86%', '2.12%'),
 (datetime.date(1996, 7, 9), Decimal('3730.0000'), '28.21%', '3.76%'),
 (datetime.date(1996, 7, 10), Decimal('1444.8000'), '33.00%', '4.40%'),
 (datetime.date(1996, 7, 11), Decimal('625.2000'), '35.07%', '4.68%'),
 (datetime.date(1996, 7, 12), Decimal('2490.5000'), '43.31%', '5.78%'),
 (datetime.date(1996, 7, 15), Decimal('517.8000'), '45.03%', '6.01%'),
 (datetime.date(1996, 7, 16), Decimal('1119.9000'), '48.74%', '6.50%'),
 (datetime.date(1996, 7, 17), Decimal('2018.6000'), '55.43%', '7.39%'),
 (datetime.date(1996, 7, 18), Decimal('100.8000'), '55.76%', '7.44%'),
 (datetime.date(1996, 7, 19), Decimal('2194.2000'), '63.03%', '8.41%'),
 (datetime.date(1996, 7, 22), Decimal('624.8000'), '65.10%', '8.68%'),
 (datetime.date(1996, 7, 23), Decimal('2464.8000'), '73.26%', '9.77%'),
 (datetime.date(1996, 7, 24), Decimal('724.5000'), '75.66%', '10.09%'),
 (datetime.date(1996, 7, 25), Decimal('1176.0000'), '79.55%', '10.61%'),
 (datetime.date(1996, 7, 26), Decimal('364.8000'), '80.76%', '10.78%'),
 (datetime.date(1996, 7, 29), Decimal('4031.0000'), '94.11%', '12.56%'),
 (datetime.date(1996, 7, 30), Decimal('1101.2000'), '97.76%', '13.04%'),
 (datetime.date(1996, 7, 31), Decimal('676.0000'), '100.00%', '13.34%')]

## MySQL queries using Pandas

In [10]:
query = ('''
        SELECT o.OrderDate, SUM(p.amount) AS amount
        FROM Orders o 
        JOIN (SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount FROM Order_Details GROUP BY OrderID) p 
        USING(OrderID) 
        GROUP BY o.OrderDate
        ORDER BY o.OrderDate
        ''')
result = %sql $query
df = result.DataFrame()

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
480 rows affected.

In [11]:
df = df.set_index('OrderDate')
df['amount'] = df['amount'].astype(float)

In [12]:
df.head(10)

            amount
OrderDate
1996-07-04   440.0
1996-07-05  1863.4
1996-07-08  2483.8
1996-07-09  3730.0
1996-07-10  1444.8
1996-07-11   625.2
1996-07-12  2490.5
1996-07-15   517.8
1996-07-16  1119.9
1996-07-17  2018.6

### Compare m-o-m and y-o-y growth rate

In [13]:
df['ld_pct'] = ((df['amount'] - df['amount'].shift(1))/df['amount'].shift(1)).apply(lambda x: format(x,'.2%'))
df['lw_pct'] = ((df['amount'] - df['amount'].shift(7))/df['amount'].shift(7)).apply(lambda x: format(x,'.2%'))
# df['ld_pct_2'] = df['amount'].pct_change()
# df['lw_pct_2'] = df['amount'].pct_change(7)

In [14]:
df.head(10)

            amount   ld_pct   lw_pct
OrderDate
1996-07-04   440.0     nan%     nan%
1996-07-05  1863.4  323.50%     nan%
1996-07-08  2483.8   33.29%     nan%
1996-07-09  3730.0   50.17%     nan%
1996-07-10  1444.8  -61.27%     nan%
1996-07-11   625.2  -56.73%     nan%
1996-07-12  2490.5  298.35%     nan%
1996-07-15   517.8  -79.21%   17.68%
1996-07-16  1119.9  116.28%  -39.90%
1996-07-17  2018.6   80.25%  -18.73%

### Cumulative growth rate

In [15]:
df['month'] = df.index.strftime('%Y-%m')
df['year'] = df.index.strftime('%Y')

In [16]:
df['mth_cum_amount'] = df.groupby('month')['amount'].transform('cumsum')
df['yr_cum_amount'] = df.groupby('year')['amount'].transform('cumsum')
df['mth_total_amount'] = df.groupby('month')['amount'].transform('sum')
df['yr_total_amount'] = df.groupby('year')['amount'].transform('sum')

In [17]:
df['mth_cum_pct'] = (df['mth_cum_amount']/df['mth_total_amount']).apply(lambda x: format(x,'.2%'))
df['yr_cum_pct'] = (df['yr_cum_amount']/df['yr_total_amount']).apply(lambda x: format(x,'.2%'))

In [18]:
df[['amount','mth_cum_pct','yr_cum_pct']].head(20)

            amount mth_cum_pct yr_cum_pct
OrderDate
1996-07-04   440.0       1.46%      0.19%
1996-07-05  1863.4       7.63%      1.02%
1996-07-08  2483.8      15.86%      2.12%
1996-07-09  3730.0      28.21%      3.76%
1996-07-10  1444.8      33.00%      4.40%
1996-07-11   625.2      35.07%      4.68%
1996-07-12  2490.5      43.31%      5.78%
1996-07-15   517.8      45.03%      6.01%
1996-07-16  1119.9      48.74%      6.50%
1996-07-17  2018.6      55.43%      7.39%
1996-07-18   100.8      55.76%      7.44%
1996-07-19  2194.2      63.03%      8.41%
1996-07-22   624.8      65.10%      8.68%
1996-07-23  2464.8      73.26%      9.77%
1996-07-24   724.5      75.66%     10.09%
1996-07-25  1176.0      79.55%     10.61%
1996-07-26   364.8      80.76%     10.78%
1996-07-29  4031.0      94.11%     12.56%
1996-07-30  1101.2      97.76%     13.04%
1996-07-31   676.0     100.00%     13.34%

## Daily active user

In [19]:
%%sql
SELECT o.OrderID, o.CustomerID, o.OrderDate, o.EmployeeID  
FROM Orders o 
JOIN (
    SELECT CustomerID, OrderDate
    FROM (SELECT *, 
            ROW_NUMBER() OVER (PARTITION BY CustomerID, OrderDate ORDER BY (SELECT 1)) AS test 
        FROM Orders) t1
    WHERE test = 2
) t2
ON o.CustomerID = t2.CustomerID 
AND o.OrderDate = t2.OrderDate;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
14 rows affected.

[(10410, 'BOTTM', datetime.datetime(1997, 1, 10, 0, 0), 3),
 (10411, 'BOTTM', datetime.datetime(1997, 1, 10, 0, 0), 9),
 (10616, 'GREAL', datetime.datetime(1997, 7, 31, 0, 0), 1),
 (10617, 'GREAL', datetime.datetime(1997, 7, 31, 0, 0), 4),
 (10456, 'KOENE', datetime.datetime(1997, 2, 25, 0, 0), 8),
 (10457, 'KOENE', datetime.datetime(1997, 2, 25, 0, 0), 2),
 (10972, 'LACOR', datetime.datetime(1998, 3, 24, 0, 0), 4),
 (10973, 'LACOR', datetime.datetime(1998, 3, 24, 0, 0), 6),
 (10838, 'LINOD', datetime.datetime(1998, 1, 19, 0, 0), 3),
 (10840, 'LINOD', datetime.datetime(1998, 1, 19, 0, 0), 4),
 (10713, 'SAVEA', datetime.datetime(1997, 10, 22, 0, 0), 1),
 (10714, 'SAVEA', datetime.datetime(1997, 10, 22, 0, 0), 5),
 (11030, 'SAVEA', datetime.datetime(1998, 4, 17, 0, 0), 7),
 (11031, 'SAVEA', datetime.datetime(1998, 4, 17, 0, 0), 6)]

In [20]:
%%sql 
SELECT * 
FROM (
    SELECT OrderDate, COUNT(CustomerID) AS ct_uid, COUNT(DISTINCT CustomerID) AS ct_uid_dist 
    FROM Orders 
    GROUP BY OrderDate
    ORDER BY OrderDate
) t1 
WHERE ct_uid != ct_uid_dist;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
7 rows affected.

[(datetime.datetime(1997, 1, 10, 0, 0), 2, 1),
 (datetime.datetime(1997, 2, 25, 0, 0), 2, 1),
 (datetime.datetime(1997, 7, 31, 0, 0), 2, 1),
 (datetime.datetime(1997, 10, 22, 0, 0), 2, 1),
 (datetime.datetime(1998, 1, 19, 0, 0), 3, 2),
 (datetime.datetime(1998, 3, 24, 0, 0), 4, 3),
 (datetime.datetime(1998, 4, 17, 0, 0), 4, 3)]

In [21]:
%%sql 
SELECT CustomerID, COUNT(OrderID) AS num_orders
FROM Orders 
GROUP BY CustomerID
ORDER BY num_orders DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[('SAVEA', 31),
 ('ERNSH', 30),
 ('QUICK', 28),
 ('HUNGO', 19),
 ('FOLKO', 19),
 ('BERGS', 18),
 ('RATTC', 18),
 ('HILAA', 18),
 ('BONAP', 17),
 ('LEHMS', 15)]

### Login data for calculating daily active user 
https://zhuanlan.zhihu.com/p/104463563

In [22]:
from datetime import timedelta 

login = pd.read_csv('login_table.csv', names=['uid','login','ip'])
login.drop(columns=['ip'], inplace=True)
login.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3003 entries, 1 to 3003
Data columns (total 2 columns):
uid      3003 non-null int64
login    3003 non-null object
dtypes: int64(1), object(1)
memory usage: 70.4+ KB

In [23]:
login.head(5)

   uid                login
1  466  2017-01-07 18:24:07
2  466  2017-01-07 18:24:55
3  458  2017-01-07 18:25:18
4  458  2017-01-07 18:26:21
5  592  2017-01-07 19:09:59

In [24]:
login['date'] = pd.to_datetime(login['login'], format='%Y-%m-%d').apply(lambda x: x.date())

In [25]:
login.groupby('date')['uid'].count()

date
2017-01-07     5
2017-01-08     4
2017-01-09    15
2017-01-10    19
2017-01-11    23
              ..
2017-12-31     2
2018-01-01     5
2018-01-02     8
2018-01-03    13
2018-01-04     6
Name: uid, Length: 328, dtype: int64

In [26]:
login.groupby('date').aggregate({'uid': lambda x: x.nunique()})

            uid
date
2017-01-07    3
2017-01-08    3
2017-01-09    9
2017-01-10    9
2017-01-11    8
...         ...
2017-12-31    2
2018-01-01    5
2018-01-02    7
2018-01-03    8
2018-01-04    4

[328 rows x 1 columns]

Drop duplicated login users

In [27]:
login.drop(columns=['login'],inplace=True)
login.drop_duplicates(inplace=True)
login.reset_index(inplace=True,drop=True)

In [28]:
login.head(10)

   uid        date
0  466  2017-01-07
1  458  2017-01-07
2  592  2017-01-07
3  393  2017-01-08
4  592  2017-01-08
5  636  2017-01-08
6  458  2017-01-09
7  413  2017-01-09
8  592  2017-01-09
9  500  2017-01-09

In [29]:
login['last_date'] = login['date'] + timedelta(-1)

In [30]:
login_new = pd.merge(login, login, left_on=['uid', 'date'], right_on=['uid', 'last_date'], how='left')
login_new.drop(columns=['last_date_x','last_date_y'], inplace=True)
login_new.head(10)

   uid      date_x      date_y
0  466  2017-01-07         NaN
1  458  2017-01-07         NaN
2  592  2017-01-07  2017-01-08
3  393  2017-01-08  2017-01-09
4  592  2017-01-08  2017-01-09
5  636  2017-01-08         NaN
6  458  2017-01-09  2017-01-10
7  413  2017-01-09  2017-01-10
8  592  2017-01-09  2017-01-10
9  500  2017-01-09         NaN

In [31]:
login_new['init_user'] = login_new.groupby('date_x')['uid'].transform('nunique')
login_new['next_day_user'] = login_new.groupby('date_y')['uid'].transform('nunique')

In [32]:
login_new.head(20)

    uid      date_x      date_y  init_user  next_day_user
0   466  2017-01-07         NaN          3            NaN
1   458  2017-01-07         NaN          3            NaN
2   592  2017-01-07  2017-01-08          3            1.0
3   393  2017-01-08  2017-01-09          3            2.0
4   592  2017-01-08  2017-01-09          3            2.0
5   636  2017-01-08         NaN          3            NaN
6   458  2017-01-09  2017-01-10          9            5.0
7   413  2017-01-09  2017-01-10          9            5.0
8   592  2017-01-09  2017-01-10          9            5.0
9   500  2017-01-09         NaN          9            NaN
10  585  2017-01-09         NaN          9            NaN
11  492  2017-01-09  2017-01-10          9            5.0
12  470  2017-01-09  2017-01-10          9            5.0
13  393  2017-01-09         NaN          9            NaN
14  639  2017-01-09         NaN          9            NaN
15  592  2017-01-10  2017-01-11          9            4.0
16  458  2017-01-10  2017-01-11          9            4.0
17  462  2017-01-10         NaN          9            NaN
18  413  2017-01-10  2017-01-11          9            4.0
19  640  2017-01-10         NaN          9            NaN

In [33]:
login_new = login_new[login_new['date_y'].notnull()]

In [34]:
login_new.drop(columns=['uid','date_y'], inplace=True)

In [35]:
login_new.drop_duplicates(inplace=True)

In [36]:
login_new.head(20)

         date_x  init_user  next_day_user
2    2017-01-07          3            1.0
3    2017-01-08          3            2.0
6    2017-01-09          9            5.0
15   2017-01-10          9            4.0
24   2017-01-11          8            6.0
32   2017-01-12         10            5.0
43   2017-01-13          8            2.0
52   2017-01-14          4            2.0
55   2017-01-15          4            3.0
59   2017-01-16         11            5.0
69   2017-01-17          7            5.0
76   2017-01-18         11            3.0
88   2017-01-19          7            4.0
98   2017-01-20          7            3.0
103  2017-01-21          5            1.0
106  2017-01-22          2            1.0
108  2017-01-23          7            2.0
117  2017-01-24          6            2.0
129  2017-01-26          4            2.0
132  2017-01-27          5            4.0

In [37]:
login_new['one_remain_rate'] = (login_new['next_day_user'] / login_new['init_user']).apply(lambda x: format(x, '.2%'))

In [38]:
login_new.head(10)

        date_x  init_user  next_day_user one_remain_rate
2   2017-01-07          3            1.0          33.33%
3   2017-01-08          3            2.0          66.67%
6   2017-01-09          9            5.0          55.56%
15  2017-01-10          9            4.0          44.44%
24  2017-01-11          8            6.0          75.00%
32  2017-01-12         10            5.0          50.00%
43  2017-01-13          8            2.0          25.00%
52  2017-01-14          4            2.0          50.00%
55  2017-01-15          4            3.0          75.00%
59  2017-01-16         11            5.0          45.45%

In [39]:
# init_user = login_new.groupby('date_x').aggregate({'uid': lambda x: x.nunique()})
# init_user.head(10)
# next_day_user = login_new.groupby('date_y').aggregate({'uid': lambda x: x.nunique()})
# next_day_user.head(10)

In [40]:
def cal_n_day_remain(df, n):
    dates = pd.Series(df.date.unique()).sort_values()[:-n]#取截止到n天的日期，保证有n日留存
    users = [] #定义列表存放初始用户数
    remains = []#定义列表存放留存用户数
    for d in dates:
        user = df[df['date'] == d]['uid'].unique()#当日活跃用户
        user_n_day = df[df['date']==d+timedelta(n)]['uid'].unique()#n日后活跃用户
        remain = [x for x in user_n_day if x in user]#取交集
        users.append(len(user))
        remains.append(len(remain))
    #一次循环计算一天的n日留存 
    #循环结束后构造dataframe并返回
    remain_df = pd.DataFrame({'date': dates, 'user': users, 'remain': remains})
    return remain_df

In [41]:
one_day_remain = cal_n_day_remain(login, 1)
one_day_remain.head(10)

         date  user  remain
0  2017-01-07     3       1
1  2017-01-08     3       2
2  2017-01-09     9       5
3  2017-01-10     9       4
4  2017-01-11     8       6
5  2017-01-12    10       5
6  2017-01-13     8       2
7  2017-01-14     4       2
8  2017-01-15     4       3
9  2017-01-16    11       5

In [42]:
seven_day_remain = cal_n_day_remain(login, 6)
seven_day_remain.head(10)

         date  user  remain
0  2017-01-07     3       2
1  2017-01-08     3       1
2  2017-01-09     9       3
3  2017-01-10     9       5
4  2017-01-11     8       5
5  2017-01-12    10       7
6  2017-01-13     8       4
7  2017-01-14     4       3
8  2017-01-15     4       2
9  2017-01-16    11       1

## Different JOIN

In [43]:
%%sql
SELECT 'num of customers in database' AS d, COUNT(DISTINCT CustomerID) AS num
FROM Customers
UNION
SELECT 'num of customers ordered', COUNT(DISTINCT CustomerID)
FROM Orders

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
2 rows affected.

[('num of customers in database', 91), ('num of customers ordered', 89)]

In [44]:
%%sql
SELECT c.*
FROM Orders o
RIGHT OUTER JOIN Customers c 
USING(CustomerID)
WHERE o.OrderID IS NULL

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
2 rows affected.

[('FISSA', 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'Accounting Manager', 'C/ Moralzarzal, 86', 'Madrid', None, '28034', 'Spain', '(91) 555 94 44', '(91) 555 55 93'),
 ('PARIS', 'Paris spécialités', 'Marie Bertrand', 'Owner', '265, boulevard Charonne', 'Paris', None, '75012', 'France', '(1) 42.34.22.66', '(1) 42.34.22.77')]

## Random Sampling

In [45]:
%%sql
SELECT * FROM Customers LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67'),
 ('BLAUS', 'Blauer See Delikatessen', 'Hanna Moos', 'Sales Representative', 'Forsterstr. 57', 'Mannheim', None, '68306', 'Germany', '0621-08460', '0621-08924'),
 ('BLONP', 'Blondesddsl père et fils', 'Frédérique Citeaux', 'Marketing Manager', '24, place Kléber', 'Strasbourg', None, '67000', 'France', '88.60.15.31', '88.60.15.32'),
 ('BOLID', 'Bólido Comidas preparadas', 'Martín Sommer', 'Owner', 'C/ Araquil, 67', 'Madrid', None, '28023', 'Spain', '(91) 555 22 82', '(91) 555 91 99'),
 ('BONAP', "Bon app'", 'Laurence Lebihan', 'Owner', '12, rue des Bouchers', 'Marseille', None, '13008', 'France', '91.24.45.40', '91.24.45.41'),
 ('BOTTM', 'Bottom-Dollar Markets', 'Elizabeth Lincoln', 'Accounting Manager', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada', '(604) 555-4729', '(604) 555-3745')]

In [46]:
%%sql
SELECT * FROM Customers ORDER BY RAND() LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[('HUNGC', 'Hungry Coyote Import Store', 'Yoshi Latimer', 'Sales Representative', 'City Center Plaza 516 Main St.', 'Elgin', 'OR', '97827', 'USA', '(503) 555-6874', '(503) 555-2376'),
 ('MAGAA', 'Magazzini Alimentari Riuniti', 'Giovanni Rovelli', 'Marketing Manager', 'Via Ludovico il Moro 22', 'Bergamo', None, '24100', 'Italy', '035-640230', '035-640231'),
 ('PERIC', 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Sales Representative', 'Calle Dr. Jorge Cash 321', 'México D.F.', None, '05033', 'Mexico', '(5) 552-3745', '(5) 545-3745'),
 ('LAMAI', "La maison d'Asie", 'Annette Roulet', 'Sales Manager', '1 rue Alsace-Lorraine', 'Toulouse', None, '31000', 'France', '61.77.61.10', '61.77.61.11'),
 ('TRADH', 'Tradição Hipermercados', 'Anabela Domingues', 'Sales Representative', 'Av. Inês de Castro, 414', 'Sao Paulo', 'SP', '05634-030', 'Brazil', '(11) 555-2167', '(11) 555-2168'),
 ('HANAR', 'Hanari Carnes', 'Mario Pontes', 'Accounting Manager', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', '(21) 555-0091', '(21) 555-8765'),
 ('LEHMS', 'Lehmanns Marktstand', 'Renate Messner', 'Sales Representative', 'Magazinweg 7', 'Frankfurt a.M.', None, '60528', 'Germany', '069-0245984', '069-0245874'),
 ('HUNGO', 'Hungry Owl All-Night Grocers', 'Patricia McKenna', 'Sales Associate', '8 Johnstown Road', 'Cork', 'Co. Cork', None, 'Ireland', '2967 542', '2967 3333'),
 ('MEREP', 'Mère Paillarde', 'Jean Fresnière', 'Marketing Assistant', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada', '(514) 555-8054', '(514) 555-8055'),
 ('WARTH', 'Wartian Herkku', 'Pirkko Koskitalo', 'Accounting Manager', 'Torikatu 38', 'Oulu', None, '90110', 'Finland', '981-443655', '981-443655')]

In [47]:
%%sql
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME='Orders';

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
14 rows affected.

[('def', 'Northwind', 'Orders', 'OrderID', 1, None, 'NO', 'int', None, None, 10, 0, None, None, None, 'int', 'PRI', 'auto_increment', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'CustomerID', 2, None, 'YES', 'char', 5, 20, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'char(5)', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'EmployeeID', 3, None, 'YES', 'int', None, None, 10, 0, None, None, None, 'int', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'OrderDate', 4, None, 'YES', 'datetime', None, None, None, None, 0, None, None, 'datetime', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'RequiredDate', 5, None, 'YES', 'datetime', None, None, None, None, 0, None, None, 'datetime', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShippedDate', 6, None, 'YES', 'datetime', None, None, None, None, 0, None, None, 'datetime', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipVia', 7, None, 'YES', 'int', None, None, 10, 0, None, None, None, 'int', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'Freight', 8, None, 'YES', 'decimal', None, None, 19, 4, None, None, None, 'decimal(19,4)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipName', 9, None, 'YES', 'varchar', 40, 160, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(40)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipAddress', 10, None, 'YES', 'varchar', 60, 240, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(60)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipCity', 11, None, 'YES', 'varchar', 15, 60, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(15)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipRegion', 12, None, 'YES', 'varchar', 15, 60, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(15)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipPostalCode', 13, None, 'YES', 'varchar', 10, 40, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(10)', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'Northwind', 'Orders', 'ShipCountry', 14, None, 'YES', 'varchar', 15, 60, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(15)', '', '', 'select,insert,update,references', '', '', None)]

In [48]:
%%sql
SELECT * FROM Orders LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(10248, 'VINET', 5, datetime.datetime(1996, 7, 4, 0, 0), datetime.datetime(1996, 8, 1, 0, 0), datetime.datetime(1996, 7, 16, 0, 0), 3, Decimal('32.3800'), 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.datetime(1996, 7, 5, 0, 0), datetime.datetime(1996, 8, 16, 0, 0), datetime.datetime(1996, 7, 10, 0, 0), 1, Decimal('11.6100'), 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.datetime(1996, 7, 8, 0, 0), datetime.datetime(1996, 8, 5, 0, 0), datetime.datetime(1996, 7, 12, 0, 0), 2, Decimal('65.8300'), 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.datetime(1996, 7, 8, 0, 0), datetime.datetime(1996, 8, 5, 0, 0), datetime.datetime(1996, 7, 15, 0, 0), 1, Decimal('41.3400'), 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.datetime(1996, 7, 9, 0, 0), datetime.datetime(1996, 8, 6, 0, 0), datetime.datetime(1996, 7, 11, 0, 0), 2, Decimal('51.3000'), 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium'),
 (10253, 'HANAR', 3, datetime.datetime(1996, 7, 10, 0, 0), datetime.datetime(1996, 7, 24, 0, 0), datetime.datetime(1996, 7, 16, 0, 0), 2, Decimal('58.1700'), 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10254, 'CHOPS', 5, datetime.datetime(1996, 7, 11, 0, 0), datetime.datetime(1996, 8, 8, 0, 0), datetime.datetime(1996, 7, 23, 0, 0), 2, Decimal('22.9800'), 'Chop-suey Chinese', 'Hauptstr. 31', 'Bern', None, '3012', 'Switzerland'),
 (10255, 'RICSU', 9, datetime.datetime(1996, 7, 12, 0, 0), datetime.datetime(1996, 8, 9, 0, 0), datetime.datetime(1996, 7, 15, 0, 0), 3, Decimal('148.3300'), 'Richter Supermarkt', 'Starenweg 5', 'Genève', None, '1204', 'Switzerland'),
 (10256, 'WELLI', 3, datetime.datetime(1996, 7, 15, 0, 0), datetime.datetime(1996, 8, 12, 0, 0), datetime.datetime(1996, 7, 17, 0, 0), 2, Decimal('13.9700'), 'Wellington Importadora', 'Rua do Mercado, 12', 'Resende', 'SP', '08737-363', 'Brazil'),
 (10257, 'HILAA', 4, datetime.datetime(1996, 7, 16, 0, 0), datetime.datetime(1996, 8, 13, 0, 0), datetime.datetime(1996, 7, 22, 0, 0), 3, Decimal('81.9100'), 'HILARION-Abastos', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '5022', 'Venezuela')]

In [49]:
%%sql
# SELECT MIN(OrderID), MAX(OrderID) FROM Orders; 
# SELECT ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders ORDER BY rkid DESC;
SELECT ROUND(RAND()*(SELECT ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders ORDER BY rkid DESC LIMIT 1)) AS oid;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
1 rows affected.

[(622.0,)]

In [50]:
%%sql
SELECT *
FROM (SELECT *, ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders) o 
JOIN (SELECT ROUND(RAND()*(SELECT ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders ORDER BY rkid DESC LIMIT 1)) AS oid) t
WHERE o.rkid > t.oid 
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(10327, 'FOLKO', 2, datetime.datetime(1996, 10, 11, 0, 0), datetime.datetime(1996, 11, 8, 0, 0), datetime.datetime(1996, 10, 14, 0, 0), 1, Decimal('63.3600'), 'Folk och fä HB', 'Åkergatan 24', 'Bräcke', None, 'S-844 67', 'Sweden', 80, 79.0),
 (10328, 'FURIB', 4, datetime.datetime(1996, 10, 14, 0, 0), datetime.datetime(1996, 11, 11, 0, 0), datetime.datetime(1996, 10, 17, 0, 0), 3, Decimal('87.0300'), 'Furia Bacalhau e Frutos do Mar', 'Jardim das rosas n. 32', 'Lisboa', None, '1675', 'Portugal', 81, 79.0),
 (10329, 'SPLIR', 4, datetime.datetime(1996, 10, 15, 0, 0), datetime.datetime(1996, 11, 26, 0, 0), datetime.datetime(1996, 10, 23, 0, 0), 2, Decimal('191.6700'), 'Split Rail Beer & Ale', 'P.O. Box 555', 'Lander', 'WY', '82520', 'USA', 82, 79.0),
 (10330, 'LILAS', 3, datetime.datetime(1996, 10, 16, 0, 0), datetime.datetime(1996, 11, 13, 0, 0), datetime.datetime(1996, 10, 28, 0, 0), 1, Decimal('12.7500'), 'LILA-Supermercado', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '3508', 'Venezuela', 83, 79.0),
 (10331, 'BONAP', 9, datetime.datetime(1996, 10, 16, 0, 0), datetime.datetime(1996, 11, 27, 0, 0), datetime.datetime(1996, 10, 21, 0, 0), 1, Decimal('10.1900'), "Bon app'", '12, rue des Bouchers', 'Marseille', None, '13008', 'France', 84, 79.0),
 (10332, 'MEREP', 3, datetime.datetime(1996, 10, 17, 0, 0), datetime.datetime(1996, 11, 28, 0, 0), datetime.datetime(1996, 10, 21, 0, 0), 2, Decimal('52.8400'), 'Mère Paillarde', '43 rue St. Laurent', 'Montréal', 'Québec', 'H1J 1C3', 'Canada', 85, 79.0),
 (10333, 'WARTH', 5, datetime.datetime(1996, 10, 18, 0, 0), datetime.datetime(1996, 11, 15, 0, 0), datetime.datetime(1996, 10, 25, 0, 0), 3, Decimal('0.5900'), 'Wartian Herkku', 'Torikatu 38', 'Oulu', None, '90110', 'Finland', 86, 79.0),
 (10334, 'VICTE', 8, datetime.datetime(1996, 10, 21, 0, 0), datetime.datetime(1996, 11, 18, 0, 0), datetime.datetime(1996, 10, 28, 0, 0), 2, Decimal('8.5600'), 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France', 87, 79.0),
 (10335, 'HUNGO', 7, datetime.datetime(1996, 10, 22, 0, 0), datetime.datetime(1996, 11, 19, 0, 0), datetime.datetime(1996, 10, 24, 0, 0), 2, Decimal('42.1100'), 'Hungry Owl All-Night Grocers', '8 Johnstown Road', 'Cork', 'Co. Cork', None, 'Ireland', 88, 79.0),
 (10336, 'PRINI', 7, datetime.datetime(1996, 10, 23, 0, 0), datetime.datetime(1996, 11, 20, 0, 0), datetime.datetime(1996, 10, 25, 0, 0), 2, Decimal('15.5100'), 'Princesa Isabel Vinhos', 'Estrada da saúde n. 58', 'Lisboa', None, '1756', 'Portugal', 89, 79.0)]

https://statsbot.co/blog/select-random-rows-sql/

In [51]:
%%sql
SELECT *
FROM (
    SELECT *, ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid
    FROM Orders
) o 
WHERE MOD(rkid,11) = 9
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(10256, 'WELLI', 3, datetime.datetime(1996, 7, 15, 0, 0), datetime.datetime(1996, 8, 12, 0, 0), datetime.datetime(1996, 7, 17, 0, 0), 2, Decimal('13.9700'), 'Wellington Importadora', 'Rua do Mercado, 12', 'Resende', 'SP', '08737-363', 'Brazil', 9),
 (10267, 'FRANK', 4, datetime.datetime(1996, 7, 29, 0, 0), datetime.datetime(1996, 8, 26, 0, 0), datetime.datetime(1996, 8, 6, 0, 0), 1, Decimal('208.5800'), 'Frankenversand', 'Berliner Platz 43', 'München', None, '80805', 'Germany', 20),
 (10278, 'BERGS', 8, datetime.datetime(1996, 8, 12, 0, 0), datetime.datetime(1996, 9, 9, 0, 0), datetime.datetime(1996, 8, 16, 0, 0), 2, Decimal('92.6900'), 'Berglunds snabbköp', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', 31),
 (10289, 'BSBEV', 7, datetime.datetime(1996, 8, 26, 0, 0), datetime.datetime(1996, 9, 23, 0, 0), datetime.datetime(1996, 8, 28, 0, 0), 3, Decimal('22.7700'), "B's Beverages", 'Fauntleroy Circus', 'London', None, 'EC2 5NT', 'UK', 42),
 (10300, 'MAGAA', 2, datetime.datetime(1996, 9, 9, 0, 0), datetime.datetime(1996, 10, 7, 0, 0), datetime.datetime(1996, 9, 18, 0, 0), 2, Decimal('17.6800'), 'Magazzini Alimentari Riuniti', 'Via Ludovico il Moro 22', 'Bergamo', None, '24100', 'Italy', 53),
 (10311, 'DUMON', 1, datetime.datetime(1996, 9, 20, 0, 0), datetime.datetime(1996, 10, 4, 0, 0), datetime.datetime(1996, 9, 26, 0, 0), 3, Decimal('24.6900'), 'Du monde entier', '67, rue des Cinquante Otages', 'Nantes', None, '44000', 'France', 64),
 (10322, 'PERIC', 7, datetime.datetime(1996, 10, 4, 0, 0), datetime.datetime(1996, 11, 1, 0, 0), datetime.datetime(1996, 10, 23, 0, 0), 3, Decimal('0.4000'), 'Pericles Comidas clásicas', 'Calle Dr. Jorge Cash 321', 'México D.F.', None, '05033', 'Mexico', 75),
 (10333, 'WARTH', 5, datetime.datetime(1996, 10, 18, 0, 0), datetime.datetime(1996, 11, 15, 0, 0), datetime.datetime(1996, 10, 25, 0, 0), 3, Decimal('0.5900'), 'Wartian Herkku', 'Torikatu 38', 'Oulu', None, '90110', 'Finland', 86),
 (10344, 'WHITC', 4, datetime.datetime(1996, 11, 1, 0, 0), datetime.datetime(1996, 11, 29, 0, 0), datetime.datetime(1996, 11, 5, 0, 0), 2, Decimal('23.2900'), 'White Clover Markets', '1029 - 12th Ave. S.', 'Seattle', 'WA', '98124', 'USA', 97),
 (10355, 'AROUT', 6, datetime.datetime(1996, 11, 15, 0, 0), datetime.datetime(1996, 12, 13, 0, 0), datetime.datetime(1996, 11, 20, 0, 0), 1, Decimal('41.9500'), 'Around the Horn', 'Brook Farm Stratford St. Mary', 'Colchester', 'Essex', 'CO7 6JX', 'UK', 108)]

https://www.mysqltutorial.org/select-random-records-database-table.aspx

In [52]:
%%sql
SELECT 
    t. *
FROM
    (SELECT 
        ROUND(RAND() * (
            SELECT ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders ORDER BY rkid DESC LIMIT 1
        )) random_num,
            @num:=@num + 1
    FROM
        (SELECT @num:=0) AS a, Orders
    LIMIT 10) AS b,
    (SELECT *, ROW_NUMBER() OVER (ORDER BY (SELECT 1)) AS rkid FROM Orders) AS t
WHERE
    b.random_num = t.rkid;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
10 rows affected.

[(10438, 'TOMSP', 3, datetime.datetime(1997, 2, 6, 0, 0), datetime.datetime(1997, 3, 6, 0, 0), datetime.datetime(1997, 2, 14, 0, 0), 2, Decimal('8.2400'), 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 191),
 (10963, 'FURIB', 9, datetime.datetime(1998, 3, 19, 0, 0), datetime.datetime(1998, 4, 16, 0, 0), datetime.datetime(1998, 3, 26, 0, 0), 3, Decimal('2.7000'), 'Furia Bacalhau e Frutos do Mar', 'Jardim das rosas n. 32', 'Lisboa', None, '1675', 'Portugal', 716),
 (10764, 'ERNSH', 6, datetime.datetime(1997, 12, 3, 0, 0), datetime.datetime(1997, 12, 31, 0, 0), datetime.datetime(1997, 12, 8, 0, 0), 3, Decimal('145.4500'), 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria', 517),
 (10686, 'PICCO', 2, datetime.datetime(1997, 9, 30, 0, 0), datetime.datetime(1997, 10, 28, 0, 0), datetime.datetime(1997, 10, 8, 0, 0), 1, Decimal('96.5000'), 'Piccolo und mehr', 'Geislweg 14', 'Salzburg', None, '5020', 'Austria', 439),
 (10890, 'DUMON', 7, datetime.datetime(1998, 2, 16, 0, 0), datetime.datetime(1998, 3, 16, 0, 0), datetime.datetime(1998, 2, 18, 0, 0), 1, Decimal('32.7600'), 'Du monde entier', '67, rue des Cinquante Otages', 'Nantes', None, '44000', 'France', 643),
 (10486, 'HILAA', 1, datetime.datetime(1997, 3, 26, 0, 0), datetime.datetime(1997, 4, 23, 0, 0), datetime.datetime(1997, 4, 2, 0, 0), 2, Decimal('30.5300'), 'HILARION-Abastos', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '5022', 'Venezuela', 239),
 (10341, 'SIMOB', 7, datetime.datetime(1996, 10, 29, 0, 0), datetime.datetime(1996, 11, 26, 0, 0), datetime.datetime(1996, 11, 5, 0, 0), 3, Decimal('26.7800'), 'Simons bistro', 'Vinbæltet 34', 'Kobenhavn', None, '1734', 'Denmark', 94),
 (10833, 'OTTIK', 6, datetime.datetime(1998, 1, 15, 0, 0), datetime.datetime(1998, 2, 12, 0, 0), datetime.datetime(1998, 1, 23, 0, 0), 2, Decimal('71.4900'), 'Ottilies Käseladen', 'Mehrheimerstr. 369', 'Köln', None, '50739', 'Germany', 586),
 (10403, 'ERNSH', 4, datetime.datetime(1997, 1, 3, 0, 0), datetime.datetime(1997, 1, 31, 0, 0), datetime.datetime(1997, 1, 9, 0, 0), 3, Decimal('73.7900'), 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria', 156),
 (10928, 'GALED', 1, datetime.datetime(1998, 3, 5, 0, 0), datetime.datetime(1998, 4, 2, 0, 0), datetime.datetime(1998, 3, 18, 0, 0), 1, Decimal('1.3600'), 'Galería del gastronómo', 'Rambla de Cataluña, 23', 'Barcelona', None, '8022', 'Spain', 681)]

## Segment Data into Deciles
https://www.sqlservercentral.com/articles/segment-data-into-deciles

More query questions are here: 
- https://www.sqlservercentral.com/articles/the-query-answers-with-sql-server-series

In [54]:
%%sql 
WITH order_amounts AS (
    SELECT o.OrderID, o.CustomerID, o.EmployeeID, o.OrderDate, p.amount 
    FROM Orders o 
    JOIN (
        SELECT OrderID, SUM(UnitPrice * Quantity) AS Amount 
        FROM Order_Details 
        GROUP BY OrderID
    ) p 
    USING(OrderID) 
    ORDER BY OrderID
) 
SELECT *, NTILE(10) OVER (PARTITION BY EmployeeID ORDER BY amount) AS amount_decile
FROM order_amounts 
ORDER BY EmployeeID, amount_decile, amount DESC
LIMIT 20;

 * mysql+mysqlconnector://root:***@localhost:3306/Northwind
20 rows affected.

[(10604, 'FURIB', 1, datetime.datetime(1997, 7, 18, 0, 0), Decimal('256.5000'), 1),
 (10508, 'OTTIK', 1, datetime.datetime(1997, 4, 16, 0, 0), Decimal('240.0000'), 1),
 (10473, 'ISLAT', 1, datetime.datetime(1997, 3, 13, 0, 0), Decimal('230.4000'), 1),
 (10655, 'REGGC', 1, datetime.datetime(1997, 9, 3, 0, 0), Decimal('193.0000'), 1),
 (10482, 'LAZYK', 1, datetime.datetime(1997, 3, 21, 0, 0), Decimal('147.0000'), 1),
 (10928, 'GALED', 1, datetime.datetime(1998, 3, 5, 0, 0), Decimal('137.5000'), 1),
 (10950, 'MAGAA', 1, datetime.datetime(1998, 3, 16, 0, 0), Decimal('110.0000'), 1),
 (10969, 'COMMI', 1, datetime.datetime(1998, 3, 23, 0, 0), Decimal('108.0000'), 1),
 (10710, 'FRANS', 1, datetime.datetime(1997, 10, 20, 0, 0), Decimal('93.5000'), 1),
 (10371, 'LAMAI', 1, datetime.datetime(1996, 12, 3, 0, 0), Decimal('91.2000'), 1),
 (11067, 'DRACD', 1, datetime.datetime(1998, 5, 4, 0, 0), Decimal('86.8500'), 1),
 (10992, 'THEBI', 1, datetime.datetime(1998, 4, 1, 0, 0), Decimal('69.6000'), 1),
 (10900, 'WELLI', 1, datetime.datetime(1998, 2, 20, 0, 0), Decimal('45.0000'), 1),
 (10374, 'WOLZA', 1, datetime.datetime(1996, 12, 5, 0, 0), Decimal('459.0000'), 2),
 (10453, 'AROUT', 1, datetime.datetime(1997, 2, 21, 0, 0), Decimal('453.0000'), 2),
 (10910, 'WILMK', 1, datetime.datetime(1998, 2, 26, 0, 0), Decimal('452.9000'), 2),
 (10394, 'HUNGC', 1, datetime.datetime(1996, 12, 25, 0, 0), Decimal('442.0000'), 2),
 (10376, 'MEREP', 1, datetime.datetime(1996, 12, 9, 0, 0), Decimal('420.0000'), 2),
 (10405, 'LINOD', 1, datetime.datetime(1997, 1, 6, 0, 0), Decimal('400.0000'), 2),
 (10792, 'WOLZA', 1, datetime.datetime(1997, 12, 23, 0, 0), Decimal('399.8500'), 2)]

More interesting queries 
- https://statsbot.co/blog/event-analytics-define-user-sessions-sql/
- https://statsbot.co/blog/calculating-customer-lifetime-value-sql-example/